Tekla Open API Reference for Tekla Structures 2025
InputDefinitionFactory Methods
The InputDefinitionFactory type exposes the following members.
Methods
Name | Description
CreateInputDefinition(Tuple<DrawingObject, ViewBase>)
 Creates a single-object input definition.
CreateInputDefinition(Tuple<Point, ViewBase>)
 Creates a single-point input definition.
CreateInputDefinition(Tuple<PointList, ViewBase>)
 Creates a multi-point input definition.
CreateInputDefinition(ViewBase, DrawingObject)
 Creates a single-object input definition.
CreateInputDefinition(ViewBase, PointList)
 Creates a multi-point input definition.
CreateInputDefinition(ViewBase, Point)
 Creates a single-point input definition.
CreateInputDefinition(ViewBase, Point, Point)
 Creates a two-point input definition.
CreateInputDefinition(ViewBase, Point, Point, Point)
 Creates a three-point input definition.
GetDrawingObject
 Gets the object from the given single-object input.
GetPoint
 Gets the point from the given single-point input.
GetPoints
 Gets the points from the given n-point input.
GetView
 Gets the view that the given input belongs to.
Top
See Also
Reference
InputDefinitionFactory Class
Tekla.Structures.Drawing.Tools Namespace